In [1]:
import pandas as pd
import numpy as np

---

In [2]:
raw_data = {'col1':[1, 2, 3], 'col2':[4, 5, 6], 'col3':[7, 8, 9], 'col4':[10, 11, 12], 'col5':['a', 'b', 'c']}
table = pd.DataFrame(data=raw_data, index=['A', 'B', 'C'])
table

   col1  col2  col3  col4 col5
A     1     4     7    10    a
B     2     5     8    11    b
C     3     6     9    12    c

In [3]:
print(table.values)
print(table.index)
print(table.columns)

[[1 4 7 10 'a']
 [2 5 8 11 'b']
 [3 6 9 12 'c']]
Index(['A', 'B', 'C'], dtype='object')
Index(['col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

In [4]:
print(table.dtypes)

col1     int64
col2     int64
col3     int64
col4     int64
col5    object
dtype: object

---

In [5]:
print(table)
print('-'*30)
print(table.T)

   col1  col2  col3  col4 col5
A     1     4     7    10    a
B     2     5     8    11    b
C     3     6     9    12    c
------------------------------
       A   B   C
col1   1   2   3
col2   4   5   6
col3   7   8   9
col4  10  11  12
col5   a   b   c

---

In [6]:
table['col1']

A    1
B    2
C    3
Name: col1, dtype: int64

In [7]:
table.col1

A    1
B    2
C    3
Name: col1, dtype: int64

In [8]:
col = table.columns
print(table[col[0]])
print('-'*30)
print(table[col[:3]])

A    1
B    2
C    3
Name: col1, dtype: int64
------------------------------
   col1  col2  col3
A     1     4     7
B     2     5     8
C     3     6     9

In [9]:
table.loc['A']

col1     1
col2     4
col3     7
col4    10
col5     a
Name: A, dtype: object

In [10]:
row = table.index
print(table.loc[row[0]])
print('-'*30)
print(table.loc[row[[0, 2]]])

col1     1
col2     4
col3     7
col4    10
col5     a
Name: A, dtype: object
------------------------------
   col1  col2  col3  col4 col5
A     1     4     7    10    a
C     3     6     9    12    c

---

In [11]:
table['col1']>=2

A    False
B     True
C     True
Name: col1, dtype: bool

In [12]:
mask = table['col1']>=2
table[mask]

   col1  col2  col3  col4 col5
B     2     5     8    11    b
C     3     6     9    12    c

In [13]:
mask1 = table['col1']>=2
mask2 = table['col5']=='b'
table[mask1 & mask2]

   col1  col2  col3  col4 col5
B     2     5     8    11    b

In [14]:
table.isin(['a', 'c'])

    col1   col2   col3   col4   col5
A  False  False  False  False   True
B  False  False  False  False  False
C  False  False  False  False   True

---

In [15]:
mask = table['col5'].isin(['a', 'c'])
table[mask]

   col1  col2  col3  col4 col5
A     1     4     7    10    a
C     3     6     9    12    c

---

In [16]:
table.drop(['col1'], axis=1)

   col2  col3  col4 col5
A     4     7    10    a
B     5     8    11    b
C     6     9    12    c

In [17]:
table.drop(['A'], axis=0)

   col1  col2  col3  col4 col5
B     2     5     8    11    b
C     3     6     9    12    c

---

In [18]:
pd.concat([table, table])

   col1  col2  col3  col4 col5
A     1     4     7    10    a
B     2     5     8    11    b
C     3     6     9    12    c
A     1     4     7    10    a
B     2     5     8    11    b
C     3     6     9    12    c

In [19]:
pd.concat([table, table], axis=1)

   col1  col2  col3  col4 col5  col1  col2  col3  col4 col5
A     1     4     7    10    a     1     4     7    10    a
B     2     5     8    11    b     2     5     8    11    b
C     3     6     9    12    c     3     6     9    12    c

---

In [20]:
print(table.mean())
print('-'*30)
print(table['col1'].max())
print('-'*30)
print(table.describe())

col1     2.0
col2     5.0
col3     8.0
col4    11.0
dtype: float64
------------------------------
3
------------------------------
       col1  col2  col3  col4
count   3.0   3.0   3.0   3.0
mean    2.0   5.0   8.0  11.0
std     1.0   1.0   1.0   1.0
min     1.0   4.0   7.0  10.0
25%     1.5   4.5   7.5  10.5
50%     2.0   5.0   8.0  11.0
75%     2.5   5.5   8.5  11.5
max     3.0   6.0   9.0  12.0

---

In [21]:
raw_data = {'col1':[1, 2, 3], 'col2':[4, 5, 6], 'col3':[7, 8, 9], 'col4':[10, 11, 12], 'col5':['a', 'b', 'c']}
table = pd.DataFrame(data=raw_data, index=['C', 'B', 'A'])
table

   col1  col2  col3  col4 col5
C     1     4     7    10    a
B     2     5     8    11    b
A     3     6     9    12    c

In [22]:
table.sort_index()

   col1  col2  col3  col4 col5
A     3     6     9    12    c
B     2     5     8    11    b
C     1     4     7    10    a

In [23]:
table['col1'].sort_values()

C    1
B    2
A    3
Name: col1, dtype: int64

In [24]:
table.sort_values(by=['col2'], ascending=False)

   col1  col2  col3  col4 col5
A     3     6     9    12    c
B     2     5     8    11    b
C     1     4     7    10    a

---

In [25]:
raw_data = {'col1':[1, 2, 3], 'col2':[4, 5, 6], 'col3':[7, 8, 9], 'col4':[10, 11, 12], 'col5':['a', 'b', 'c']}
table = pd.DataFrame(data=raw_data, index=['A', 'B', 'C'])
table

   col1  col2  col3  col4 col5
A     1     4     7    10    a
B     2     5     8    11    b
C     3     6     9    12    c

In [26]:
table['col4'] = np.nan
table

   col1  col2  col3  col4 col5
A     1     4     7   NaN    a
B     2     5     8   NaN    b
C     3     6     9   NaN    c

In [27]:
table.isnull()

    col1   col2   col3  col4   col5
A  False  False  False  True  False
B  False  False  False  True  False
C  False  False  False  True  False

In [28]:
table['col4'].isnull().sum()

3

---

In [29]:
raw_data = {'col1':[1, 2, 3], 'col2':[4, 5, 6], 'col3':[7, 8, 9], 'col4':[10, 11, 12], 'col5':['a', 'b', 'c']}
table = pd.DataFrame(data=raw_data, index=['A', 'B', 'C'])
table

   col1  col2  col3  col4 col5
A     1     4     7    10    a
B     2     5     8    11    b
C     3     6     9    12    c

In [30]:
table.iloc[0]

col1     1
col2     4
col3     7
col4    10
col5     a
Name: A, dtype: object

In [31]:
table.iloc[0, 3]

10

In [32]:
table.iloc[:, 1]

A    4
B    5
C    6
Name: col2, dtype: int64

In [33]:
# table.iat[0]
table.iat[0, 3]
# table.iat[:, 1]

10

In [34]:
table.at['A', 'col1']

1

In [35]:
table.loc['A'].at['col1']

1

---

### 參考資料
- https://stackoverflow.com/questions/28757389/pandas-loc-vs-iloc-vs-at-vs-iat